# ReferenceViewerUiTargetFilter Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ReferenceViewerUiTargetFilter Property
ParameterTypeId Class See Also
---
"Filter": This is used by the UI to filter the list of target views.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ReferenceViewerUiTargetFilter { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ReferenceViewerUiTargetFilter As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ReferenceViewerUiTargetFilter {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace